# CurveArrayIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveArrayIterator Class
Members See Also
---
An iterator to a curve array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class CurveArrayIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class CurveArrayIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class CurveArrayIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..CurveArrayIterator
# See Also
CurveArrayIterator Members
Autodesk.Revit.DB Namespace